#include <stdio.h>
#define TWIDTH 20 //ширина терминала, символов
#define TABLEN 8 //ширина табул€ции
#define MAXLEN 1000 //максимальна€ длина входной  строки
#define YES  1 //вошли ли мы в "непробельный" участок строки: YES - пробелы миновали, начались видимые символы
#define NO 0 //пробелы в начале строки продолжаютс€

int getlen();
void fold(int len);

char line[MAXLEN];
int set_new_line = NO; //надо ли строку вывода завершить символом новой строки

int main() {
	
	int len, i;
	
	// пока вход§ща§ строка не пуста§
	while((len = getlen()) != 0) {

		//если длина строки превышает TWIDTH - вызываем fold() дл€ переработки строки 
		if (len > TWIDTH) 
			fold(len);
		//или традиционно печатаем посимвольно массив
		else {
			i = 0;
			while(i < len) {
				printf("%c", line[i]);
				++i;
			}
		}
	if (set_new_line != NO) //см. комментарии в fold()
		printf("\n");
	}
	
	return 0;
}

/* функци≤ подсчета длины строки и записи вход≤щей строки в массив */
int getlen() {

	int c, len = 0;
	
	/* увеличиваем счетчик символов в строке пока не встретитс≤ символ новой строки и записываем символы в массив */
	while((c = getchar()) != EOF && c != '\n') {
	
		/* встречаем символ табул§ции - вызываем ф-ю detab() и передаем ей номер текущей позиции в массиве */
		if (c == '\t') 
			len = detab(len);
		else {
			line[len] = c;
			++len;
		}
	}
	
	return len;
}

/* функци§ замены символов табул§ции количеством = TABLEN символами пробелов */
int detab (int i) {
	
	/* прибавл§ем к текущей позиции к-во пробелов до текущей позиции табул§ции */
	int shift = i + (TABLEN - i % TABLEN);
	
	while (i < shift) {
		line[i] = ' ';
		++i;
	}
	/* возвращаем значение позиции в массиве после смещени§ */
	return i;
	
}
//функци€ сворачивани€ строки путем вставки после стодбца #TWIDTH символа новой строки
void fold (int len) {
	
	int i = 0;
	int ii = 0;
	int is_head = NO; //находимс€ ли мы в пустом (пробельном) заголовке строки
	//пока не пройдемс€ по всем символам исходного строчного массива line[]
	while (i < len) {
		//достигаем кра€ терминала - начинаем новую строчку, устанавливаем флаг пустого заголовка дл€ отсеивани€ начальных пробелов
		if (ii == TWIDTH) {
			printf("\n");
			is_head = NO;
			ii = 0;
		}
		//пропускаем начальные пробелы
		if (is_head == NO && line[i] == ' ') {
			set_new_line = NO; //если нова€ строчка вывода начата, но дальше одни пробелы, то в main() новую строчку не начинаем
			++i;
		}
		else {
			//встречаем первый непробельный символ - печатаем его и устанавливаем флаг новой строчки дл€ следующего вызова функции
			is_head = YES;
			printf("%c", line[i]);
			set_new_line = YES;
			++ii;
			++i;
		}
	}
}	