#include <stdio.h>
#define MAXLEN 1000

int getlen(char line[]);

int main() {
	
	int len, i;
	char line[MAXLEN];
	
/* пока вход€ща€ строка не пуста€ ....*/
	while((len = getlen(line)) != 0) {
		i = 1;
		/* начина€ с конца строки ищем пробельные и символы табул€ции пока не встретитс€ иной, в переменной i подсчитываем длину пустого "хвоста" */
		while (line[len - i] == '\t' || line[len - i] == ' ')
			++i;
		
		/* корректируем длину строки с учетом длины "хвоста" */
		len = len - i + 1;
		i = 0;

		/* если в итоге длина строки оказалась положительной (ненулева€) - выводим на печать массив посимвольно */
		if (len != 0) {
			while ( i < len) { 
				printf("%c", line[i]);
				++i;	
			}
		printf("\n");
		}
	}
	return 0;
}

/* функци€ подсчета длины строки и записи вход€щей строки в массив */
int getlen(char c_array[]) {

	int c, len = 0;
	
	/* увеличиваем счетчик символов в строке пока не встретитс€ символ новой строки и записываем символы в массив */
	while((c = getchar()) != EOF && c != '\n') {
		c_array[len] = c;
		++len;
	}
	
	return len;
}