#include <stdio.h>
#define TABLEN 8
#define MAXLEN 1000

int getlen();
int detab(int i);

char line[MAXLEN];

int main() {
	
	int len, i;
	
	/* пока вход§ща§ строка не пуста§ ... */
	while((len = getlen()) != 0) {
		i = 0;
		/* посимвольно выводим на печать строку дл§ предотвращени§ выведени§ символов предыдущей строки, если она была длиннее текущей */
		while (i < len) {
			printf("%c", line[i]);
			++i;
		}
	printf("\n");
	}
		
	return 0;
}

/* функциІ подсчета длины строки и записи входІщей строки в массив */
int getlen() {

	int c, len = 0;
	
	/* увеличиваем счетчик символов в строке пока не встретитсІ символ новой строки и записываем символы в массив */
	while((c = getchar()) != EOF && c != '\n') {
	
		/* встречаем символ табул€ции - вызываем ф-ю detab() и передаем ей номер текущей позиции в массиве */
		if (c == '\t') 
			len = detab(len);
		else {
			line[len] = c;
			++len;
		}
		
	}
	
	return len;
}

/* функци€ замены символов табул€ции количеством = TABLEN символами пробелов */
int detab (int i) {
	
	/* прибавл€ем к текущей позиции к-во пробелов до текущей позиции табул€ции */
	int shift = i + (TABLEN - i % TABLEN);
	
	while (i < shift) {
		line[i] = ' ';
		++i;
	}
	/* возвращаем значение позиции в массиве после смещени€ */
	return i;
	
}